# Pandas Examples

---
## Example 1 - Product Demand

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Create a list of products and a list of demands
products = ['Product 1', 'Product 2', 'Product 4', 'Product 6']
demands = [29, 17, 42, 21]

In [3]:
# Create a data set from these two lists
productDataset = list(zip(products, demands))
productDataset

[('Product 1', 29), ('Product 2', 17), ('Product 4', 42), ('Product 6', 21)]

In [4]:
# Create a pandas dataframe
df = pd.DataFrame(data=productDataset, columns=['Product Name', 'Demand'])
df

  Product Name  Demand
0    Product 1      29
1    Product 2      17
2    Product 4      42
3    Product 6      21

#### 1) Print just the column of product names:

In [6]:
df[['Product Name']]

  Product Name
0    Product 1
1    Product 2
2    Product 4
3    Product 6

#### 2) Print the demand column first, and the product name column second:

In [7]:
df[['Demand', 'Product Name']]

   Demand Product Name
0      29    Product 1
1      17    Product 2
2      42    Product 4
3      21    Product 6

#### 3) Print only the first 2 rows of data:

In [9]:
df[0:2]

  Product Name  Demand
0    Product 1      29
1    Product 2      17

#### 4) Print only the first 2 rows, and only the demand column:

In [12]:
df[:2][['Demand']]

   Demand
0      29
1      17

In [13]:
df[:2]['Demand']

0    29
1    17
Name: Demand, dtype: int64

In [14]:
df[['Demand']][:2]

   Demand
0      29
1      17

In [15]:
df['Demand'][:2]

0    29
1    17
Name: Demand, dtype: int64

#### 5) Print only the last 2 rows of data.  Print the demand column before the product name column.

In [16]:
df[['Demand', 'Product Name']][-2:]

   Demand Product Name
2      42    Product 4
3      21    Product 6

In [17]:
df.iloc[-2:][['Demand', 'Product Name']]

   Demand Product Name
2      42    Product 4
3      21    Product 6

#### 6) Sort the products according to decreasing demand:

In [31]:
df.sort_values(['Demand', 'Product Name'], ascending=False)

  Product Name  Demand
0    Product 4      42
1    Product 1      29
2    Product 6      21
3    Product 2      17

#### 7)  Find the product with the maximum demand
**NOTE:  Save both the product name and the corresponding maximum demand.  Do not use "for" loops.**

In [35]:
# Approach #1:

# We'll start by creating a new dataframe that has the demand
# values sorted in DESCENDING order.
# Using .head(1) will give us the first row (which corresponds
# to the maximum demand):
df1 = df.sort_values(['Demand'], ascending=False, ignore_index=True).head(1)
df1

# NOTE: If we had two products that had the maximum demand,
#       this approach would only get one of them.

  Product Name  Demand
0    Product 4      42

In [38]:
df1['Product Name'].values[0]

'Product 4'

In [39]:
# Next, we'll extract the product name and demand values:
myProd   = df1['Product Name'].values[0]
myDemand = df1['Demand'].values[0]
myProd, myDemand

('Product 4', 42)

In [41]:
df['Product Name'][df['Demand'] == df['Demand'].max()].values[0]

array(['Product 4'], dtype=object)

In [43]:
# Approach #2:

# We'll first find the maximum demand:
maxDemand  = df['Demand'].max()

# Then, we'll filter for ALL products that share the max demand.
# Using .values gives us a list (not a scalar)
maxProductList = df['Product Name'][df['Demand'] == df['Demand'].max()].values

# NOTE:  This is better than Approach #1, since we can find
#        multiple products.

In [44]:
# maxDemand is a scalar:
maxDemand

42

In [45]:
# maxProductList is a list (in this case it only has 1 element):
maxProductList

array(['Product 4'], dtype=object)

In [46]:
# It looks better when formatted as a list:
list(maxProductList)

['Product 4']

#### 8)  Add a new column of data, named 'Sales Price'

**Assign the values as numpy NaN for now***

In [59]:
df['Sales Price'] = np.nan
df

  Product Name  Demand  Sales Price  (Sales Price, 0)
0    Product 1      29          NaN               2.3
1    Product 2      17          NaN               2.3
2    Product 4      42          NaN               2.3
3    Product 6      21          NaN               2.3

#### 9) Assign the following prices to your new column

In [60]:
prices = [1.99, 2.50, 0.99, 3.75]

In [61]:
df['Sales Price'] = prices
df

  Product Name  Demand  Sales Price  (Sales Price, 0)
0    Product 1      29         1.99               2.3
1    Product 2      17         2.50               2.3
2    Product 4      42         0.99               2.3
3    Product 6      21         3.75               2.3

In [64]:
df['blah'] = 1
df['blah'] = prices
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Product Name      4 non-null      object
 1   Demand            4 non-null      int64
 2   Sales Price       4 non-null      float64
 3   (Sales Price, 0)  4 non-null      float64
 4   blah              4 non-null      float64
dtypes: float64(3), int64(1), object(1)
memory usage: 288.0+ bytes

#### 10)  Add another column named 'Cost', with the following values

In [66]:
costs = [1.0, 2.0, 0.5, 2.25]

In [67]:
df['Cost'] = costs
df

  Product Name  Demand  Sales Price  (Sales Price, 0)  blah  Cost
0    Product 1      29         1.99               2.3  1.99  1.00
1    Product 2      17         2.50               2.3  2.50  2.00
2    Product 4      42         0.99               2.3  0.99  0.50
3    Product 6      21         3.75               2.3  3.75  2.25

#### 11) Add yet another column named 'Profit'
**Profit = (sales price) - (cost)**

In [68]:
df['Profit'] = df['Sales Price'] - df['Cost']
df

  Product Name  Demand  Sales Price  (Sales Price, 0)  blah  Cost  Profit
0    Product 1      29         1.99               2.3  1.99  1.00    0.99
1    Product 2      17         2.50               2.3  2.50  2.00    0.50
2    Product 4      42         0.99               2.3  0.99  0.50    0.49
3    Product 6      21         3.75               2.3  3.75  2.25    1.50

In [74]:
df.columns

Index(['Product Name', 'Demand', 'Sales Price', 'Cost', 'Profit'], dtype='object')

In [73]:
del df[('Sales Price', 0)]

#### 12)  Add a row of data
**Product 9 has a demand of 99, a sales price of 9.99, a cost of 8.88, and a profit of 1.11**

In [75]:
df.loc[len(df)] = ['Product 9', 99, 9.99, 8.88, 1.11]
df

  Product Name  Demand  Sales Price  Cost  Profit
0    Product 1      29         1.99  1.00    0.99
1    Product 2      17         2.50  2.00    0.50
2    Product 4      42         0.99  0.50    0.49
3    Product 6      21         3.75  2.25    1.50
4    Product 9      99         9.99  8.88    1.11

In [76]:
df.loc[len(df)] = {'Product Name': 'Product 10', 'Demand': 99, 'Sales Price': 9.99, 'Cost': 8.88, 'Profit': 1.11}
df

  Product Name  Demand  Sales Price  Cost  Profit
0    Product 1      29         1.99  1.00    0.99
1    Product 2      17         2.50  2.00    0.50
2    Product 4      42         0.99  0.50    0.49
3    Product 6      21         3.75  2.25    1.50
4    Product 9      99         9.99  8.88    1.11
5   Product 10      99         9.99  8.88    1.11

#### 13) Delete the Sales Price column

#### 14) Make Product Name an index

In [81]:
df.index

Index(['Product 1', 'Product 2', 'Product 4', 'Product 6', 'Product 9',
       'Product 10'],
      dtype='object', name='Product Name')

In [80]:
df.index = df['Product Name']
df

             Product Name  Demand  Sales Price  Cost  Profit
Product Name
Product 1       Product 1      29         1.99  1.00    0.99
Product 2       Product 2      17         2.50  2.00    0.50
Product 4       Product 4      42         0.99  0.50    0.49
Product 6       Product 6      21         3.75  2.25    1.50
Product 9       Product 9      99         9.99  8.88    1.11
Product 10     Product 10      99         9.99  8.88    1.11

In [85]:
df.loc['Product 1']

Product Name    Product 1
Demand                 29
Sales Price          1.99
Cost                    1
Profit               0.99
Name: Product 1, dtype: object

#### 15)  Filter just for Product 4

In [86]:
df.loc['Product 4']

Product Name    Product 4
Demand                 42
Sales Price          0.99
Cost                  0.5
Profit               0.49
Name: Product 4, dtype: object

#### 16) Filter for products 1 through 4

In [87]:
df.loc['Product 1': 'Product 4']

             Product Name  Demand  Sales Price  Cost  Profit
Product Name
Product 1       Product 1      29         1.99   1.0    0.99
Product 2       Product 2      17         2.50   2.0    0.50
Product 4       Product 4      42         0.99   0.5    0.49

---

## Example 2 -- Daily Show Guests

In [ ]:
# Import the Daily Show guest list
csvFile = 'daily_show_guests.csv'
df = pd.read_csv(csvFile)
df

In [ ]:
df.dtypes

In [ ]:
# Convert the 'Show' date (d/m/YY) to a pandas datestamp
df['date'] = pd.to_datetime(df['Show'], infer_datetime_format=True)
df.head()

In [ ]:
# We're going to add some new columns to make it easier 
# for us to filter the data later (based on date elements):
df['Year'] = pd.DatetimeIndex(df['date']).year
df['Month'] = pd.DatetimeIndex(df['date']).month
df['Day'] = pd.DatetimeIndex(df['date']).day

# .weekday gives us integer values (0 is Monday, 6 is Sunday):
df['Weekday'] = pd.DatetimeIndex(df['date']).weekday

# .weekday_name gives us text strings:
df['WeekdayName'] = pd.DatetimeIndex(df['date']).weekday_name

df.head()

In [ ]:
# Make the date an index:
df.index = df['date']

df.index.weekday

In [ ]:
# Weekdays start with 0 (Monday) thru 6 (Sunday)
weekdayList = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']

In [ ]:
# Get some general information about our dataframe:
df['Group'].describe()

In [ ]:
# How many records do we have?
len(df)

In [ ]:
# Find rows where 'Group' is null
df[df['Group'].isnull()]

- **NOTE**:  
    - The `df['Group'].describe()` function says there are 2662 rows with a defined (i.e., non-null) 'Group' value.
    - However, `len(df)` tells us there are 2693 rows.  This means we have some records without a 'Group' defined.

In [ ]:
# Create groups:
group = df.groupby('Group').size()
group

In [ ]:
# How many groups do we have?
len(group)

**NOTE:** We have a 'Media' group and a 'media' group. 
- These are probably the same...someone just forgot to capitalize 'media'.  Let's clean up our data.

In [ ]:
# First, let's display the records where 'Group' equals 'media':
df.loc[df['Group'] == 'media','Group']

In [ ]:
# We could also DISPLAY the results like this:
df['Group'][df['Group'] == 'media']

In [ ]:
# Now, let's actually correct the error:
df.loc[df['Group'] == 'media','Group'] = 'Media'
df

In [ ]:
# NOTE:  Pandas complains about this syntax:
# df['Group'][df['Group'] == 'media'] = 'Media'
# df

In [ ]:
# Let's make sure we corrected the issue.
# This shouldn't return any results
df.loc[df['Group'] == 'media']

In [ ]:
# Let's do some more checking:
df.loc[df['Group'] == 'Media']

In [ ]:
# Alternatively:
df[df['Group'] == 'Media']

In [ ]:
# Let's compare the difference between .size() and .count():
df.groupby('Group').size()

# .size() gives us a data series with the number of records 
# for each 'Group' value.

In [ ]:
df.groupby('Group').count()

# .count() returns all of the columns of the dataframe, with 
# a count of the number of occurrances for each group.

In [ ]:
# Create a new DataFrame with just group count info:
counts_df = pd.DataFrame(df.groupby('Group').size().rename('counts'))
counts_df

In [ ]:
# Create a plot of these counts
import matplotlib.pyplot as plt

Sorted = counts_df.sort_values(['counts'], ascending=False)
Sorted.plot(kind='bar')
plt.show()

In [ ]:
# Find records with missing group names
df[['Group']][pd.isnull(df['Group']) == True]

In [ ]:
# Let's find the total number of guests:
df['Raw_Guest_List'].describe()

In [ ]:
# Filter for musicians.  Show the musician names:
df[['Raw_Guest_List']][df['Group'] == 'Musician']

In [ ]:
# Find information about Musicians:
df[['Raw_Guest_List']][df['Group'] == 'Musician'].describe()

In [ ]:
# List the unique musicians:
uniqueMusicians = df['Raw_Guest_List'][df['Group'] == 'Musician'].unique()
uniqueMusicians

In [ ]:
# We can explicitly find the number of unique musicians:
len(uniqueMusicians)

In [ ]:
# Find the guests that appeared in 2010
# Option 1 (use the year column):
df[['Raw_Guest_List']][df['Year'] == 2010]

In [ ]:
# Option 2 (use the date index):
print df[['Raw_Guest_List', 'Group']].loc['2010-1-1':'2010-12-31']

In [ ]:
# Find the guests that appeared in 2010 and were actors
df[['Raw_Guest_List', 'Group']][df['Group'] == 'Acting'].loc['2010-1-1':'2010-12-31']

In [ ]:
df[['Raw_Guest_List', 'Group']][df['Group'] == 'Acting'].loc['2010-1-1':'2010-12-31'].describe()

In [ ]:
# Find the guests that appeared in November and were politicians
df[['Raw_Guest_List']][(df['Month'] == 11) & (df['Group'] == 'Politician')]

In [ ]:
# Count the number of shows by weekday
weekday_counts = df.groupby('Weekday').count()
weekday_counts[['Year']]

In [ ]:
# Plot the number of shows by day of the week:
weekday_counts.plot.bar(color='blue');

# This figure will be confusing if people don't know that 
# "0" is "Monday".

In [ ]:
# Let's try grouping by the column that has the name of the weekday:
weekday_name_counts = df.groupby('WeekdayName').size()
weekday_name_counts

In [ ]:
# If we don't specify an ordering for the x-axis, we get
# a random order of weekdays:
weekday_name_counts.plot.bar();

In [ ]:
# Plot the number of shows by day of the week,
# but use helpful x-axis names:

# First, create a list with the order of days.
# NOTE:  There were no shows on Saturday.
weekdayList = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', \
               'Thursday', 'Friday']

# Now, plot in order of weekdayList:
weekday_name_counts[weekdayList].plot.bar(color='blue');

In [ ]:
# Find all unique occupations and groups:
set(df['GoogleKnowlege_Occupation']).union(set(df['Group']))

# This is simply the union of these two columns

In [ ]:
# Find the number of unique occupations and groups:
setOfUniques = set(df['GoogleKnowlege_Occupation']).union(set(df['Group']))
len(setOfUniques)


---

## Example 3 -- Scraping HTML Tables

*This material comes from Wes McKinney's textbook*

In [ ]:
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
# How many tables did we find on this webpage?
len(tables)

In [ ]:
# Our "failure" data will be in the first (and only) table:
failures = tables[0]

In [ ]:
failures.head()

In [ ]:
# How many bank failures were there per year?
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

In [ ]:
# Which bank failures were in NY?
failures[failures['ST'] == 'NY']

In [ ]:
# How many bank failures were in NY?
failures[failures['ST'] == 'NY']['ST'].count()


---

## Further Studying

Check out https://realpython.com/python-data-cleaning-numpy-pandas/ for some more examples.